package array_solve;

/**
 *  격자판 최대합
 *
 * 설명:
 * 5*5 격자판에 아래롸 같이 숫자가 적혀있습니다.
 *
 * N*N의 격자판이 주어지면 각 행의 합, 각 열의 합, 두 대각선의 합 중 가 장 큰 합을 출력합니다.
 *
 * 10 39 50 37 19 대각선줄
 * 12 39 30 23 11 가로줄
 * 13 39 25 27 13 세로줄
 * 19 27 50 23 15 대각선줄
 *
 * 입력:
 *  - 첫 줄에 자연수 N이 주어진다.(2<=N<=50)
 *  - 두 번째 줄부터 N줄에 걸쳐 각 줄에 N개의 자연수가 주어진다. 각 자연수는 100을 넘지 않는다.
 *
 * 출력:
 * - 최대합을 출력합니다.
 *
 * 예제:
 * 입력:
 *  5
 *  10 13 10 12 15
 *  12 39 30 23 11
 *  11 25 50 53 15
 *  19 27 29 37 27
 *  19 13 30 13 19
 *
 * 출력:
 *  155
 */
public class A9_Array {
}
